Revit 2027 API
LineLoad.StartPoint Property
 Returns the three dimensional location of the start point for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ StartPoint { get; }
Public ReadOnly Property StartPoint As XYZ
	Get
public:
property XYZ^ StartPoint {
	XYZ^ get ();
}
member StartPoint : XYZ with get
Property Value
XYZ
Remarks
 The location of the start point is measured in decimal feet.
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace